#include <stdio.h>

// Элементы списка предназначены для хранения сетевого или локального адреса.
// Адрес ресурса в сети Интернет должен содержать протокол (HTTP, FTP и т.п.), имя
// узла, путь и имя файла; адрес в локальной сети – имя компьютера, путь и имя
// файла; адрес локального ресурса – диск (однобуквенное обозначение), путь и имя
// файла; адрес электронной почты – имя узла и имя пользователя. Элемент любого
// типа сопровождается текстовым описанием. Необходимо обеспечить: сортировку
// адресов по имени узла; поиск адреса по ключевому слову в описании. При выводе
// всего списка отображать адреса в стандартном формате в соответствии с их типом.

int main() {
    printf("Hello, World!\n");
    return 0;
}
